Tekla Open API Reference for Tekla Structures 2025
AnalysisPart.Add Method
Overload List
Name | Description
Add(AnalysisArea)
 Adds an analysis area to the analysis part.
Add(AnalysisBar)
 Adds an analysis bar to the analysis part.
Top
See Also
Reference
AnalysisPart Class
Tekla.Structures.Analysis Namespace